#======== أنواع البيانات في لغة البرمجة بايثون =========#

# يوجد العديد من أنواع البيانات المعرفة مسبقا في لغة البرمجة بايثون سنتطرق للبيانات الأساسية والتي يمكن تقسيمها كالتالي:
# 1- أنواع البيانات العددية:
## أ) الأعداد الصحيحة
x = 105
## ب) الأعداد ذات الفاصلة العائمة
x = 10.5
## ج) الأعداد المركبة
x = 10j
## د) قيم التحقق
x = True + False

# 2- أنواع البيانات المتسلسلة
## أ) السلاسل النصية
s = 'أهلا بالعالم'
## ب) القوائم
my_list = ['أحمد', 5, 2.5, True, 6j]
## ج) الصفوف
my_tuple = ('أحمد', 5, 2.5, True, 6j)

## 3- المجموعات
my_set = {'python', False, 53, 1.0325}

## 4- القواميس
my_dict = {'name':'Ahmad', 'Age':50, 'Id':10235}


