from __future__ import print_function 
# هذا الملف يحتوي على بعض الامثله عن السلاسل النصيه للغة البايثون
#ماهي السلاسل النصية في البايثون ؟ 
# السلاسل النصيه هي النوع الاكثر شعبية في لغة البايثون
#  نستطيع ان ننشئها بسهوله بواسطة علامات الاقتباس  
#  لغة البايثون تتعامل مع علامات الاقتباس الفردية والزوجية على حد سواء 
# يمكن إنشاء السلاسل النصية بسهوله كإسناد قيمة إلى متغير 
# مصدر التعريف  https://www.tutorialspoint.com/python/python_strings.htm


#المثال 1
#تمت إضافتة بواسطة  @remon
# يقوم هذا المثال بطباعة السلسلة النصيه Hello World 
str1 ="Hello World"
print(str1)